SvOlli/sorbus/src/rp2040/native/core1.c
static inline void event_timer_nmi( void *data )
{
   // event handler for timer nmi
   // this event is max 1 time in queue

   // trigger NMI
   gpio_clr_mask( bus_config.mask_nmi );

   // set state for reading
   nmi_timer_triggered = true;

   // restart time if requested
   if( timer_nmi_total )
   {
      queue_event_add( timer_nmi_total, event_timer_nmi, 0 );
   }
}


static bool callback_timer_nmi( __unused struct repeating_timer *t )
{
   if( ram[0xDF0B] & 80 ) // bit 7 = NMI timer enabled
   {
      // trigger NMI
      gpio_clr_mask( bus_config.mask_nmi );

      // set state for reading
      nmi_timer_triggered = true;

      // repeat
      return true;
   }
   else
   {
      // disabled
      return false;
   }
}


static inline void event_timer_irq( void *data )
{
   // event handler for timer irq
   // this event is max 1 time in queue

   // trigger IRQ
   gpio_clr_mask( bus_config.mask_irq );

   // set state for reading
   irq_timer_triggered = true;

   // restart time if requested
   if( timer_irq_total )
   {
      queue_event_add( timer_irq_total, event_timer_irq, 0 );
   }
}


static bool callback_timer_irq( __unused struct repeating_timer *t )
{
   if( ram[0xDF0B] & 40 ) // bit 6 = IRQ timer enabled
   {
      // trigger IRQ
      gpio_clr_mask( bus_config.mask_irq );

      // set state for reading
      irq_timer_triggered = true;

      // repeat
      return true;
   }
   else
   {
      // disabled
      return false;
   }
}


static inline void timer_setup( uint8_t value, uint8_t config )
{
   config &= 0x07;
   // config bits (decoded from address)
   //           0        1
   // bit 0: lobyte   hibyte
   // bit 1: repeat   oneshot
   // bit 2: irq      nmi

   // check timer to use
   if( config & (1<<2) )
   {
      // nmi
      if( config & (1<<0) )
      {
         // highbyte: store and start timer
         timer_nmi_total |= value << 8;
         queue_event_add( timer_nmi_total, event_timer_nmi, 0 );
         if( config & (1<<1) )
         {
            // oneshot
            timer_nmi_total = 0;
         }
      }
      else
      {
         // lowbyte: store and stop timer
         queue_event_cancel( event_timer_nmi );
         timer_nmi_total = value;
      }
   }
   else
   {
      // irq
      if( config & (1<<0) )
      {
         // highbyte: store and start timer
         timer_irq_total |= value << 8;
         queue_event_add( timer_irq_total, event_timer_irq, 0 );
         if( config & (1<<1) )
         {
            // oneshot
            timer_irq_total = 0;
         }
      }
      else
      {
         // lowbyte: store and stop timer
         queue_event_cancel( event_timer_irq );
         timer_irq_total = value;
      }
   }
}


static inline void event_clear_reset( void *data )
{
   gpio_set_mask( bus_config.mask_reset );
}


static inline void system_reset()
{
   int dummy;

   if( queue_event_contains( event_clear_reset ) )
   {
      // reset sequence is already initiated
      return;
   }

   // clear some internal states
   timer_nmi_total       = 0;
   nmi_timer_triggered   = false;
   timer_irq_total       = 0;
   irq_timer_triggered   = false;
   watchdog_cycles_total = 0;

   // clear event queue and setup end of reset event
   queue_event_reset();
   queue_event_add( 8, event_clear_reset, 0 );
   // start measurement of cpu speed once every million clocks
   queue_event_add( 9, event_estimate_cpufreq, 0 );

   // setup bank
   set_bank( 1 );

   while( queue_try_remove( &queue_uart_read, &dummy ) )
   {
      // just loop until queue is empty
   }
   while( queue_try_remove( &queue_uart_write, &dummy ) )
   {
      // just loop until queue is empty
   }

   // setup serial console
   console_set_crlf( true );
   // this needs to be set, as core0 cannot access RAM
   ram[MEM_ADDR_UART_CONTROL] = 0x01;
   // reset Sorbus ID pointer
   sorbus_id_p = sorbus_id;
}


static inline void handle_scratch_mem( uint8_t flags )
{
   // not accessable RAM is used as scratch memory:
   // $D000-$D3FF 1k of scratch RAM, can be copied from/to $0000-$03FF
   // $DE00-$DEFF 256 bytes temporary storage required to swap banks
   int i;
   for( i = 0; i < 4; ++i )
   {
      if( flags & (1 << i) )
      {
         switch( flags & 0xC0 )
         {
            case 0x40:
               memcpy( &ram[0xD000+i*0x100], &ram[i*0x100], 0x100 );
               break;
            case 0x80:
               memcpy( &ram[i*0x100], &ram[0xD000+i*0x100], 0x100 );
               break;
            case 0xC0:
               memcpy( &ram[0xDE00], &ram[i*0x100], 0x100 );
               memcpy( &ram[i*0x100], &ram[0xD000+i*0x100], 0x100 );
               memcpy( &ram[0xD000+i*0x100], &ram[0xDE00], 0x100 );
               break;
         }
      }
   }
}


static inline void event_flash_sync( void *data )
{
   // event handler for flushing dhara journal
   // this event is max 1 time in queue

   dhara_flash_sync();
}


static inline void handle_flash_dma()
{
   uint16_t *lba = (uint16_t*)&ram[MEM_ADDR_ID_LBA];
   uint16_t *mem = (uint16_t*)&ram[MEM_ADDR_ID_MEM];
   int retval = 0;

   ram[address] = 0x00;
   if( !dhara_flash_size )
   {
      // size = 0: no dhara image found
      ram[address] |= 0xF0;
   }
   // filter out bad ranges, removing second line would write protect ROM
   if( (*mem < 0x0004) ||                                    // zeropage I/O
       ((*mem > (0xD000-SECTOR_SIZE)) && (*mem < 0xDF80)) || // $Dxxx I/O
       (*mem > (0x10000-SECTOR_SIZE)) )                      // would go out of bounds
   {
      // DMA would run into I/O which is not possible, only RAM works
      ram[address] |= 0xF1;
   }
   if( *lba >= 0x8000 ) // could also be if( *lba >= dhara_flash_size )
   {
      // only 32768 sectors are available
      ram[address] |= 0xF2;
   }
   if( ram[address] )
   {
      // error, do not continue
      return;
   }

   switch( address & 3 )
   {
      case 0: // read
         retval = dhara_flash_read( *lba, &ram[*mem] );
         if( queue_event_contains( event_flash_sync ) )
         {
            // delay any waiting sync events
            queue_event_cancel( event_flash_sync );
            queue_event_add( DHARA_SYNC_DELAY, event_flash_sync, 0 );
         }
         break;
      case 1: // write
         retval = dhara_flash_write( *lba, &ram[*mem] );
         // drop any waiting sync events, since a new one is created
         queue_event_cancel( event_flash_sync );
         // after ~.02 seconds without additions writes run sync
         queue_event_add( DHARA_SYNC_DELAY, event_flash_sync, 0 );
         break;
      case 3: // trim
         retval = dhara_flash_trim( *lba );
         // drop any waiting sync events, since a new one is created
         queue_event_cancel( event_flash_sync );
         // after ~.02 seconds without additions writes run sync
         queue_event_add( DHARA_SYNC_DELAY, event_flash_sync, 0 );
         break;
      default:
         break;
   }

   if( retval )
   {
      // report error, do not continue
      ram[address] = 0xF4;
      return;
   }

   // increment pointers
   (*lba)++;
   (*mem) += SECTOR_SIZE;
}


void debug_dump_state( int lineno, uint32_t _state, uint32_t _state1, uint32_t _state2, uint32_t _state3 )
{
   uint32_t addr =
      (_state & bus_config.mask_address) >> (bus_config.shift_address);
   uint8_t data = 
      (_state & bus_config.mask_data) >> (bus_config.shift_data);
   uint8_t data1 = 
      (_state1 & bus_config.mask_data) >> (bus_config.shift_data);
   uint8_t data2 = 
      (_state2 & bus_config.mask_data) >> (bus_config.shift_data);
   uint8_t data3 =
      (_state3 & bus_config.mask_data) >> (bus_config.shift_data);
   disass_show( DISASS_SHOW_NOTHING );
   printf( "%3d:%04x %c %02x %c%c%c%c%c %s\n",
      lineno, addr,
      (_state & bus_config.mask_rw) ? 'r' : 'w',
      data,
      (_state & 0x80000000) ? '*' : ' ',
      (_state & bus_config.mask_reset) ? ' ' : 'R',
      (_state & bus_config.mask_nmi) ? ' ' : 'N',
      (_state & bus_config.mask_irq) ? ' ' : 'I',
      (_state & bus_config.mask_rdy) ? ' ' : 'S',
      disass( addr, data, data1, data2, data3 ) );
}


